roeetal/enph253/Software/STM32/brain/Src/main.c
  /* Infinite loop */
  /* USER CODE BEGIN WHILE */

    while(0)
    {
        if(TAPE_LEFT_STATE == FLAGGED)
        {
            print("Tape left\n", 0);
            TAPE_LEFT_STATE = NOT_FLAGGED;
        }
        if(TAPE_RIGHT_STATE == FLAGGED)
        {
            print("Tape right\n", 0);
            TAPE_RIGHT_STATE = NOT_FLAGGED;
        }
        if(EDGE_LEFT_STATE == FLAGGED)
        {
            print("Edge left\n", 0);
            EDGE_LEFT_STATE = NOT_FLAGGED;
        }
        if(EDGE_RIGHT_STATE == FLAGGED)
        {
            print("Edge right\n", 0);
            EDGE_RIGHT_STATE = NOT_FLAGGED;
        }
        if(EDGE_RIGHT_STATE == FLAGGED)
        {
            print("Edge right\n", 0);
            EDGE_RIGHT_STATE = NOT_FLAGGED;
        }
        if(CLAW_INT_STATE == FLAGGED)
        {
            print("Claw\n", 0);
            int val = HAL_GPIO_ReadPin(CLAW_INT_GPIO_Port, CLAW_INT_Pin);
            char msg[18] = "";
            sprintf(msg, "Claw val: %d", val);
            print(msg, 0);
            CLAW_INT_STATE = NOT_FLAGGED;
        }
        

    }

    // FIXME: Make dis 1
    while (1)
    {
        // /*
        //  * Pi Turning
        //  */
        if (HAL_GPIO_ReadPin(PI_INT_GPIO_Port, PI_INT_Pin))
        {
            // Stop Requesting Images
            print("Pi interrupt\n", 0);
            // Turn to ewok
            turn();
            // Drive forward w/ PID for 2.5 s, enable claw interrupt
            set_motor_speed(TIM_CHANNEL_1, LEFT_SPEED);
            set_motor_speed(TIM_CHANNEL_3, RIGHT_SPEED);
            uint32_t start = HAL_GetTick();
        
            // Reset Claw Interrupt before driving forward
            print("MAIN | CLAW_INT UNFLAGGED\n", 0);
            while ((HAL_GetTick() - start) < 2500)
            {
                drive_straight(&enc_pid);
                // If we trip claw interrupt, debounce and grab it
                if (HAL_GPIO_ReadPin(CLAW_INT_GPIO_Port, CLAW_INT_Pin) == SET)
                {
                    print("Claw interrupt\n", 0);
                    if(debounce_and_grab(ewok_cnt, enc_pid)) break;
                }
                else if (HAL_GPIO_ReadPin(EDGE_LEFT_GPIO_Port, EDGE_LEFT_Pin) == RESET)
                {
                    set_motor_speed(TIM_CHANNEL_1, 0);
                    set_motor_speed(TIM_CHANNEL_3, 0);
                    print("Edge left triggered", 0);
                    turn_deg(30);
                }
                else if (HAL_GPIO_ReadPin(EDGE_RIGHT_GPIO_Port, EDGE_RIGHT_Pin) == RESET){
                    print("Edge right triggered", 0);
                    set_motor_speed(TIM_CHANNEL_1, 0);
                    set_motor_speed(TIM_CHANNEL_3, 0);
                    turn_deg(-30);
                }
            }

            print("ewok\n", 0);
            set_motor_speed(TIM_CHANNEL_1, 0);
            set_motor_speed(TIM_CHANNEL_3, 0);
            HAL_Delay(3000);
        }
        else
        {
            /*
             * Look for Ewok
             */
            // CLAW_INT_STATE = NOT_FLAGGED;

            // if (ewok_cnt == 4 || ewok_cnt == 5)
            // {
            //     if (EDGE_LEFT_STATE == FLAGGED && EDGE_RIGHT_STATE == NOT_FLAGGED)
            //     {
            //         drive_straight_time(&enc_pid, 0, RIGHT_SPEED - 100, 400);
            //         uint32_t temp_time = HAL_GetTick();
            //         while ((HAL_GetTick() - temp_time) < 3000 && PI_INT_STATE == NOT_FLAGGED);
            //     }
            //     else if (EDGE_LEFT_STATE == NOT_FLAGGED && EDGE_RIGHT_STATE == FLAGGED)
            //     {
            //         drive_straight_time(&enc_pid, LEFT_SPEED - 100, 0, 400);
            //         uint32_t temp_time = HAL_GetTick();
            //         while ((HAL_GetTick() - temp_time) < 3000 && PI_INT_STATE == NOT_FLAGGED);
            //     }
            // }
            
            drive_straight_time(&enc_pid, LEFT_SPEED - 100, RIGHT_SPEED - 100, 500);
            print("ewok\n", 0);
            if (HAL_GPIO_ReadPin(CLAW_INT_GPIO_Port, CLAW_INT_Pin) == SET)
                {
                    print("Claw interrupt\n", 0);
                    if(debounce_and_grab(ewok_cnt, enc_pid)) break;
                }
                else if (HAL_GPIO_ReadPin(EDGE_LEFT_GPIO_Port, EDGE_LEFT_Pin) == RESET)
                {
                    set_motor_speed(TIM_CHANNEL_1, 0);
                    set_motor_speed(TIM_CHANNEL_3, 0);
                    print("Edge left triggered", 0);
                    turn_deg(30);
                }
                else if (HAL_GPIO_ReadPin(EDGE_RIGHT_GPIO_Port, EDGE_RIGHT_Pin) == RESET){
                    print("Edge right triggered", 0);
                    set_motor_speed(TIM_CHANNEL_1, 0);
                    set_motor_speed(TIM_CHANNEL_3, 0);
                    turn_deg(-30);
                }
            uint32_t temp_time = HAL_GetTick();
            while ((HAL_GetTick() - temp_time) < 3000 && HAL_GPIO_ReadPin(PI_INT_GPIO_Port, PI_INT_Pin));
        }

  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */
    }
  /* USER CODE END 3 */

}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Configure the main internal regulator output voltage 
    */
  __HAL_RCC_PWR_CLK_ENABLE();

  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE2);

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = 16;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = 8;
  RCC_OscInitStruct.PLL.PLLN = 72;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 4;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

