roeetal/enph253/Software/STM32/brain/Src/main.c
    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* USER CODE BEGIN 4 */

void square_edge(PID_t *enc_pid)
{
    while (1)
    {
        char msg[50] = "";
        sprintf(msg, "SQUARE_EDGE | EL: %d\n", EDGE_LEFT_STATE == FLAGGED ? 1 : 0);
        print(msg, 0);
        sprintf(msg, "SQUARE_EDGE | ER: %d\n", EDGE_RIGHT_STATE == FLAGGED ? 1 : 0);
        print(msg, 0);
        print("\n", 0);
        drive_straight(enc_pid);
        if (EDGE_LEFT_STATE == FLAGGED || EDGE_RIGHT_STATE == FLAGGED)
        {
            
            if (EDGE_LEFT_STATE == FLAGGED)
            {
                set_motor_speed(TIM_CHANNEL_1, 0);
            }
            if (EDGE_RIGHT_STATE == FLAGGED)
            {
                set_motor_speed(TIM_CHANNEL_3, 0);
            }
        }
        else if (EDGE_LEFT_STATE == FLAGGED && EDGE_RIGHT_STATE == FLAGGED)
        {
            break;
        }
    }
}

void drive_straight_time(PID_t *enc_pid, uint32_t lspeed, uint32_t rspeed, uint32_t millis)
{
    set_motor_speed(TIM_CHANNEL_1, lspeed);
    set_motor_speed(TIM_CHANNEL_3, rspeed);
    uint32_t temp_time = HAL_GetTick();
    char msg[50] = "";
    uint8_t count = 0; // FIXME: Remove to speed up
    while ((HAL_GetTick() - temp_time) < millis)
    {
        if (HAL_GPIO_ReadPin(CLAW_INT_GPIO_Port, CLAW_INT_Pin) == SET)
        {
            print("Claw interrupt\n", 0);
            if(debounce_and_grab(ewok_cnt, enc_pid)) break;
        }
        else if (HAL_GPIO_ReadPin(EDGE_LEFT_GPIO_Port, EDGE_LEFT_Pin) == RESET)
        {
            set_motor_speed(TIM_CHANNEL_1, 0);
            set_motor_speed(TIM_CHANNEL_3, 0);
            print("Edge left triggered", 0);
            turn_deg(30);
        }
        else if (HAL_GPIO_ReadPin(EDGE_RIGHT_GPIO_Port, EDGE_RIGHT_Pin) == RESET){
            print("Edge right triggered", 0);
            set_motor_speed(TIM_CHANNEL_1, 0);
            set_motor_speed(TIM_CHANNEL_3, 0);
            turn_deg(-30);
        }
        else 
        {
            drive_straight(enc_pid);

        }
    }
    set_motor_speed(TIM_CHANNEL_1, 0);
    set_motor_speed(TIM_CHANNEL_3, 0);
}

void drive_straight(PID_t *enc_pid)
{
    encoder_pid(enc_pid);
    HAL_Delay(10);
    
}

/*
 * Assume motors are not on.
 * Reads adc, turns left or right based on voltage. Left max= 0 , no turn = 1.65 V, right max = 3.3V.
 */
void turn()
{
    HAL_ADC_Start_DMA(&hadc1, dma_buffer, sizeof(dma_buffer) / sizeof(dma_buffer[0]));
    //TODO calculate time needed to fill first buffer
    HAL_Delay(100);
    float volts = calculate_heading(2 * adc_values[5]);
    uint16_t counts = TURN_CONST * fabs(volts);
    TIM4->CNT = 0;
    TIM5->CNT = 0;

    char msg[18] = "";
    sprintf(msg, "TURN | cnts: %d\n", counts);
    print(msg, 0);
    int pre_dec = (int)(volts / 1);
    int post_dec = (int)((volts - pre_dec) * 1000);
    sprintf(msg, "TURN | vlts: %d.%d\n", pre_dec, post_dec);
    print(msg, 2);
    sprintf(msg, "TURN | ADC_VAL: %d\n", 2 * adc_values[5]);
    print(msg, 0);

    if (volts < -TURN_TOLERANCE)
    {
        set_motor_speed(TIM_CHANNEL_1, 0);
        set_motor_speed(TIM_CHANNEL_3, RIGHT_SPEED);
        while (TIM5->CNT < counts)
        {
            // sprintf(msg, "TIM5->CNT: %lu\n", TIM5->CNT);
            // print(msg, 4);
        }
        sprintf(msg, "TURN | TIM5->CNT: %lu\n", TIM5->CNT);
        print(msg, 4);
        TIM5->CNT = 0;
    }
    else if (volts > TURN_TOLERANCE)
    {
        set_motor_speed(TIM_CHANNEL_1, LEFT_SPEED);
        set_motor_speed(TIM_CHANNEL_3, 0);
        while (TIM4->CNT < counts)
        {
            // sprintf(msg, "TIM4->CNT: %lu\n", TIM4->CNT);
            // print(msg, 4);
        }
        sprintf(msg, "TURN | TIM4->CNT: %lu\n", TIM4->CNT);
        print(msg, 4);
        TIM4->CNT = 0;
    }
    set_motor_speed(TIM_CHANNEL_1, 0);
    set_motor_speed(TIM_CHANNEL_3, 0);
    HAL_ADC_Stop_DMA(&hadc1);
}

/*
 * Assume motors are not on.
 * Reads adc, turns left or right based on voltage. Left max= 0 , no turn = 1.65 V, right max = 3.3V.
 */
void turn_deg(int16_t deg)
{
    HAL_ADC_Start_DMA(&hadc1, dma_buffer, sizeof(dma_buffer) / sizeof(dma_buffer[0]));
    int16_t counts = 50.0 / 90.0 * (deg - 90) + 50;
    if (counts < 0) counts = -counts;
    TIM4->CNT = 0;
    TIM5->CNT = 0;

    char msg[50] = "";
    sprintf(msg, "TURN_DEG | turn count: %d\n", counts);
    print(msg, 0);

    if (deg > 0) // FIXME: Ben changed this
    {
        set_motor_speed(TIM_CHANNEL_1, LEFT_SPEED);
        set_motor_speed(TIM_CHANNEL_3, 0);
        while (TIM4->CNT < counts)
        {
            // sprintf(msg, "TIM5->CNT: %lu\n", TIM5->CNT);
            // print(msg, 4);
        }
        sprintf(msg, "TURN_DEG | TIM5->CNT: %lu\n", TIM5->CNT);
        print(msg, 4);
        TIM5->CNT = 0;
    }
    else if (deg < 0) // FIXME: Ben changed this
    {
        set_motor_speed(TIM_CHANNEL_1, 0);
        set_motor_speed(TIM_CHANNEL_3, RIGHT_SPEED);
        while (TIM5->CNT < counts)
        {
            // sprintf(msg, "TIM4->CNT: %lu\n", TIM4->CNT);
            // print(msg, 4);
        }
        sprintf(msg, "TURN_DEG | TIM4->CNT: %lu\n", TIM4->CNT);
        print(msg, 4);
        TIM4->CNT = 0;
    }
    set_motor_speed(TIM_CHANNEL_1, 0);
    set_motor_speed(TIM_CHANNEL_3, 0);
    HAL_ADC_Stop_DMA(&hadc1);
}

/**
 * Resistor ladder: 8-bit, 0->3.3v.
 * ADC: 12-bit, 0->3.3V
 *
 * @param adc_val, value read from ADC.
 * @return heading as a percentage from -50 (left) to 50 (right).
 **/
float calculate_heading(uint32_t adc_val)
{
    return adc_val / 4096.0 - 0.5;
}

