roeetal/enph253/Software/STM32/brain/Src/main.c
// Sampling frequency: 72e6/2/(495*3)
void alarm_detect()
{
    HAL_ADC_Start_DMA(&hadc1, dma_buffer, sizeof(dma_buffer) / sizeof(dma_buffer[0]));
    //TODO calculate time needed to fill first buffer
    HAL_Delay(500);
    while (goertzel(adc_values, 24242, 1000, sizeof(dma_buffer) / sizeof(dma_buffer[0]), 0) < 100);
    while (goertzel(adc_values, 24242, 1000, sizeof(dma_buffer) / sizeof(dma_buffer[0]), 0) > 100);
    HAL_ADC_Stop_DMA(&hadc1);
    IR_INT_STATE = NOT_FLAGGED;
}

/**
 * @brief prints string to row, rows from 0 - 6, resets screen when printing from row 0
 * @param msg, string to print
 * @param row, row to print msg to
 */
void print(char *msg, int row)
{
    // if (row == 0)
    // {
    //     ssd1306_Fill(Black);
    // }
    // ssd1306_SetCursor(0, row * 10);
    // ssd1306_WriteString(msg, Font_7x10, White);
    // ssd1306_UpdateScreen();
    HAL_UART_Transmit(&huart6, (uint8_t *) msg, strlen(msg), 100);
}

PID_t menu()
{
    print("Starting\n", 0);
    char msg[20] = "";
    int pid_select = 0;
    uint32_t values[2] = {0, 0};
    while (1)
    {
        if (HAL_GPIO_ReadPin(MENU_GPIO_Port, MENU_Pin) == 0)
        {
            sprintf(msg, "%lu\n", values[pid_select]);
            print(msg, 0);
            while (HAL_GPIO_ReadPin(MENU_GPIO_Port, MENU_Pin) == 0)
            {
                values[pid_select]++;
                sprintf(msg, "%lu\n", values[pid_select]);
                print(msg, 0);
                HAL_Delay(500);
            }
            ++pid_select;
        }
        if (pid_select == 2)
            break;
    }
    return pid_Init(values[0], values[1], 1, 1, 1);
}

void set_motor_speed(uint32_t channel, uint32_t speed)
{
    if (channel == TIM_CHANNEL_1)
    {
        __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_2, 0);
    }
    else if (channel == TIM_CHANNEL_2)
    {
        __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_1, 0);
    }
    else if (channel == TIM_CHANNEL_3)
    {
        __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_4, 0);
    }
    else if (channel == TIM_CHANNEL_4)
    {
        __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_3, 0);
    }
    __HAL_TIM_SET_COMPARE(&htim1, channel, speed > 1000 ? 1000 : speed);
}

void encoder_pid(PID_t *enc_pid)
{
    /* Get error */
    uint32_t lcnt = TIM4->CNT;
    uint32_t rcnt = TIM5->CNT;
    enc_pid->err = lcnt - rcnt;

    /* Get gain */
    // Gain <0 for ride side faster
    int gain = pid_GetGain(enc_pid);

    /* Set Motor Speeds*/
    uint32_t lspeed = LEFT_SPEED;
    uint32_t rspeed = RIGHT_SPEED;
    if (gain < 0)
    {
        lspeed -= gain;
    }
    else if (gain > 0)
    {
        rspeed += gain;
    }

    // char msg[18] = "";
    // sprintf(msg, "LS: %lu", lspeed);
    // print(msg, 0);
    // sprintf(msg, "RS: %lu", rspeed);
    // print(msg, 1);
    // set_motor_speed(TIM_CHANNEL_1, lspeed);
    // set_motor_speed(TIM_CHANNEL_3, rspeed);

    /* Prevent weird overflow shit */
    if (lcnt > 60000 || rcnt > 60000)
    {
        TIM4->CNT -= 50000;
        TIM5->CNT -= 50000;
    }
}

int debounce_and_grab(ewok_cnt, enc_pid)
{
    set_motor_speed(TIM_CHANNEL_1, 0);
    set_motor_speed(TIM_CHANNEL_3, 0);
    uint32_t timeee = HAL_GetTick();
    // int count = 0;
    int ewok = TRUE;
    // while (HAL_GetTick() - timeee < 50)
    // {
    //     ++count;
    //     HAL_Delay(5);
    //     if (HAL_GPIO_ReadPin(CLAW_INT_GPIO_Port, CLAW_INT_Pin) == GPIO_PIN_RESET)
    //     {
    //         print("CLAW_GRAB | Claw debounced. No ewok found\n", 0);
    //         ewok = FALSE;
    //         break;
    //     }
    // }
    // char msg[50] = "";
    // sprintf(msg, "CLAW_GRAB | Debounced with %d checks\n", count);
    // print(msg, 0);
    // If claw is still high, we have an ewok. Stop, grab it, continue on
    // hardcoded procedure
    if (ewok)
    {
        print("CLAW_GRAB | grabbing ewok\n", 0);
        HAL_Delay(400);
        set_motor_speed(TIM_CHANNEL_1, 0);
        set_motor_speed(TIM_CHANNEL_3, 0);
        close_claw(&htim3);
        arm_up(&htim3);
        // TODO: delete next line, there for testing!!!
        HAL_Delay(1000);
        ++ewok_cnt;
        // char msg[18] = "";
        // sprintf(msg, "wok_cnt: %d\n", ewok_cnt);
        // print(msg, 0);
        /*
            * Claw is up and closed
            * Ewok Count incremented
            * Motors not powered
            * CLAW_INT_STATE not FLAGGED, interrupt disabled
            */

        // For the first ewok, turn left, arm up, square robot w/ edge,
        // drive straight for 3 s, bring arm down
        if (ewok_cnt == 1)
        {
            print("First ewok captured\n", 0);
            turn_deg(-400);
            open_claw(&htim3);
            // TODO: Add edge squaring back in
            // set_motor_speed(TIM_CHANNEL_3, RIGHT_SPEED);
            // set_motor_speed(TIM_CHANNEL_1, LEFT_SPEED);
            // square_edge(&enc_pid);
            drive_straight_time(&enc_pid, LEFT_SPEED, RIGHT_SPEED, 10000);
        }

        if (ewok_cnt == 2)
        {
            print("Second ewok captured\n",0);
            turn_deg(-110); //  Prolly have to change this
            alarm_detect();
            set_motor_speed(TIM_CHANNEL_3, RIGHT_SPEED);
            set_motor_speed(TIM_CHANNEL_1, LEFT_SPEED);
            open_claw(&htim3);
            timeee = HAL_GetTick();
            while (HAL_GetTick() - timeee < 7000)
            {
                if (TAPE_LEFT_STATE == FLAGGED && TAPE_RIGHT_STATE != FLAGGED)
                {
                    set_motor_speed(TIM_CHANNEL_3, 0);
                    // Tape detects object when high
                    while (HAL_GPIO_ReadPin(TAPE_LEFT_GPIO_Port, TAPE_LEFT_Pin) == GPIO_PIN_SET);
                    HAL_Delay(100);
                    TAPE_LEFT_STATE = NOT_FLAGGED;
                    set_motor_speed(TIM_CHANNEL_3, RIGHT_SPEED);
                }
                else if (TAPE_RIGHT_STATE == FLAGGED && TAPE_LEFT_STATE != FLAGGED)
                {
                    set_motor_speed(TIM_CHANNEL_1, 0);
                    while (HAL_GPIO_ReadPin(TAPE_RIGHT_GPIO_Port, TAPE_RIGHT_Pin) == GPIO_PIN_SET);
                    HAL_Delay(100);
                    TAPE_RIGHT_STATE = NOT_FLAGGED;
                    set_motor_speed(TIM_CHANNEL_1, LEFT_SPEED);
                }
            }
            arm_down(&htim3);
        }

        if (ewok_cnt == 3)
        {
            print("Third ewok captured\n", 0);
            turn_deg(110);
            set_motor_speed(TIM_CHANNEL_3, RIGHT_SPEED);
            set_motor_speed(TIM_CHANNEL_1, LEFT_SPEED);
            open_claw(&htim3);
            drive_straight_time(&enc_pid, LEFT_SPEED, RIGHT_SPEED, 1500);
            drive_straight_time(&enc_pid, 600, 600, 1500);
            arm_down(&htim3);
            // todo delete below
            set_motor_speed(TIM_CHANNEL_3, RIGHT_SPEED);
            set_motor_speed(TIM_CHANNEL_1, LEFT_SPEED);
        }

